БухЭксп/Catalogs/CW_ДокументыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДокументыТС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ТранспортныеСредства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокументаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументовТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДокументыТС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидДокументаТСПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьПредставлениеДокумента()
	// --- 
	
	Объект.Наименование = Объект.ВидДокументаТС.КраткоеНаименование + " " +СокрЛП(Объект.Серия)+"№"+СокрЛП(Объект.Номер)+" от "+Формат(Объект.ДатаВыдачи,"ДФ=dd.MM.yyyy"); 
	
	// --- 
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ДоступностьПредставленияЭлемента();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьПредставлениеПриИзменении(Элемент)
	
	_ДоступностьПредставленияЭлемента();
	
КонецПроцедуры

&наСервере
Процедура _ДоступностьПредставленияЭлемента()
	
	Элементы.Представление.ТолькоПросмотр = Не Объект.РедактироватьПредставление;
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
